summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCbs_regdef.h
/** \\brief  TG Capture for Cores - HALT */
typedef struct _Ifx_CBS_TCCH_Bits
{
    unsigned int C0:1;                      /**< \brief [0:0] Capture of HALT Signal of CPUx (rh) */
    unsigned int C1:1;                      /**< \brief [1:1] Capture of HALT Signal of CPUx (rh) */
    unsigned int C2:1;                      /**< \brief [2:2] Capture of HALT Signal of CPUx (rh) */
    unsigned int reserved_3:28;             /**< \brief \internal Reserved */
    unsigned int HSM:1;                     /**< \brief [31:31] Capture of HALT Signal of <Security_Module> (rh) */
} Ifx_CBS_TCCH_Bits;

/** \\brief  TG Capture for TG Input Pins */
typedef struct _Ifx_CBS_TCIP_Bits
{
    unsigned int P0:1;                      /**< \brief [0:0] Capture of Trigger Input Pin x (rh) */
    unsigned int P1:1;                      /**< \brief [1:1] Capture of Trigger Input Pin x (rh) */
    unsigned int P2:1;                      /**< \brief [2:2] Capture of Trigger Input Pin x (rh) */
    unsigned int P3:1;                      /**< \brief [3:3] Capture of Trigger Input Pin x (rh) */
    unsigned int P4:1;                      /**< \brief [4:4] Capture of Trigger Input Pin x (rh) */
    unsigned int P5:1;                      /**< \brief [5:5] Capture of Trigger Input Pin x (rh) */
    unsigned int P6:1;                      /**< \brief [6:6] Capture of Trigger Input Pin x (rh) */
    unsigned int P7:1;                      /**< \brief [7:7] Capture of Trigger Input Pin x (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CBS_TCIP_Bits;

/** \\brief  TG Capture for MCDS */
typedef struct _Ifx_CBS_TCM_Bits
{
    unsigned int BRK:1;                     /**< \brief [0:0] Capture of MCDS break_out (rh) */
    unsigned int SUS:1;                     /**< \brief [1:1] Capture of MCDS suspend_out (rh) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int T0:1;                      /**< \brief [8:8] Capture of MCDS trig_out x (rh) */
    unsigned int T1:1;                      /**< \brief [9:9] Capture of MCDS trig_out x (rh) */
    unsigned int T2:1;                      /**< \brief [10:10] Capture of MCDS trig_out x (rh) */
    unsigned int T3:1;                      /**< \brief [11:11] Capture of MCDS trig_out x (rh) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_CBS_TCM_Bits;

/** \\brief  TG Capture for OTGB0/1 */
typedef struct _Ifx_CBS_TCTGB_Bits
{
    unsigned int OTGB0:16;                  /**< \brief [15:0] Capture Bits for OTGB0 (rh) */
    unsigned int OTGB1:16;                  /**< \brief [31:16] Capture Bits for OTGB1 (rh) */
} Ifx_CBS_TCTGB_Bits;

/** \\brief  TG Capture for TG Lines */
typedef struct _Ifx_CBS_TCTL_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int TL1:1;                     /**< \brief [1:1] Capture of Trigger Line x (rh) */
    unsigned int TL2:1;                     /**< \brief [2:2] Capture of Trigger Line x (rh) */
    unsigned int TL3:1;                     /**< \brief [3:3] Capture of Trigger Line x (rh) */
    unsigned int TL4:1;                     /**< \brief [4:4] Capture of Trigger Line x (rh) */
    unsigned int TL5:1;                     /**< \brief [5:5] Capture of Trigger Line x (rh) */
    unsigned int TL6:1;                     /**< \brief [6:6] Capture of Trigger Line x (rh) */
    unsigned int TL7:1;                     /**< \brief [7:7] Capture of Trigger Line x (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CBS_TCTL_Bits;

/** \\brief  TG Input Pins Routing */
typedef struct _Ifx_CBS_TIPR_Bits
{
    unsigned int PIN0:4;                    /**< \brief [3:0] Trigger Pin x to Trigger Line Routing (rw) */
    unsigned int PIN1:4;                    /**< \brief [7:4] Trigger Pin x to Trigger Line Routing (rw) */
    unsigned int PIN2:4;                    /**< \brief [11:8] Trigger Pin x to Trigger Line Routing (rw) */
    unsigned int PIN3:4;                    /**< \brief [15:12] Trigger Pin x to Trigger Line Routing (rw) */
    unsigned int PIN4:4;                    /**< \brief [19:16] Trigger Pin x to Trigger Line Routing (rw) */
    unsigned int PIN5:4;                    /**< \brief [23:20] Trigger Pin x to Trigger Line Routing (rw) */
    unsigned int PIN6:4;                    /**< \brief [27:24] Trigger Pin x to Trigger Line Routing (rw) */
    unsigned int PIN7:4;                    /**< \brief [31:28] Trigger Pin x to Trigger Line Routing (rw) */
} Ifx_CBS_TIPR_Bits;

/** \\brief  TG Line 1 Suspend Targets */
typedef struct _Ifx_CBS_TL1ST_Bits
{
    unsigned int C0:1;                      /**< \brief [0:0] CPUx as Suspend Target (rw) */
    unsigned int C1:1;                      /**< \brief [1:1] CPUx as Suspend Target (rw) */
    unsigned int C2:1;                      /**< \brief [2:2] CPUx as Suspend Target (rw) */
    unsigned int reserved_3:25;             /**< \brief \internal Reserved */
    unsigned int HSS:1;                     /**< \brief [28:28] HSSL as Suspend Target (rw) */
    unsigned int DMA:1;                     /**< \brief [29:29] DMA as Suspend Target (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int HSM:1;                     /**< \brief [31:31] <Security_Module> as Suspend Target (rw) */
} Ifx_CBS_TL1ST_Bits;

/** \\brief  TG Line Control */
typedef struct _Ifx_CBS_TLC_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int TLSP1:4;                   /**< \brief [7:4] TG Line Signal Processing (rw) */
    unsigned int TLSP2:4;                   /**< \brief [11:8] TG Line Signal Processing (rw) */
    unsigned int TLSP3:4;                   /**< \brief [15:12] TG Line Signal Processing (rw) */
    unsigned int TLSP4:4;                   /**< \brief [19:16] TG Line Signal Processing (rw) */
    unsigned int TLSP5:4;                   /**< \brief [23:20] TG Line Signal Processing (rw) */
    unsigned int TLSP6:4;                   /**< \brief [27:24] TG Line Signal Processing (rw) */
    unsigned int TLSP7:4;                   /**< \brief [31:28] TG Line Signal Processing (rw) */
} Ifx_CBS_TLC_Bits;

/** \\brief  TG Line Counter Control */
typedef struct _Ifx_CBS_TLCC_Bits
{
    unsigned int TGL:4;                     /**< \brief [3:0] Trigger Line to Counter Routing (rw) */
    unsigned int LE:3;                      /**< \brief [6:4] Level or Edge Counting (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int CLR:2;                     /**< \brief [9:8] Clear and Enable Counter(s) (w) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int STOP:2;                    /**< \brief [13:12] Stop Counter(s) (w) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_CBS_TLCC_Bits;

/** \\brief  TG Line Capture and Hold Enable */
typedef struct _Ifx_CBS_TLCHE_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int TL1:1;                     /**< \brief [1:1] Capture and Hold Enable for Trigger Line x (rw) */
    unsigned int TL2:1;                     /**< \brief [2:2] Capture and Hold Enable for Trigger Line x (rw) */
    unsigned int TL3:1;                     /**< \brief [3:3] Capture and Hold Enable for Trigger Line x (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_CBS_TLCHE_Bits;

/** \\brief  TG Line Capture and Hold Clear */
typedef struct _Ifx_CBS_TLCHS_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int TL1:1;                     /**< \brief [1:1] Capture and Hold Clear for Trigger Line x (w) */
    unsigned int TL2:1;                     /**< \brief [2:2] Capture and Hold Clear for Trigger Line x (w) */
    unsigned int TL3:1;                     /**< \brief [3:3] Capture and Hold Clear for Trigger Line x (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_CBS_TLCHS_Bits;

